2022-10-08-привіт,-чудовий-світе.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://vlnn.dev/rss.xml"
      title="RSS feed for https://vlnn.dev/">
<title>Привіт, чудовий світе</title>
<meta name="author" content="Volodymyr Anokhin">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<link rel="apple-touch-icon-precomposed" href="static/favicon-152.png">
<link rel="msapplication-TitleImage" href="static/favicon-144.png">
<link rel="msapplication-TitleColor" href="#0141ff">
<link rel="stylesheet" href="static/katex.min.css">
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="h1">
  <a href="https://vlnn.dev">Generalistic stuff VLNN writes</a>
  <div class="sitelinks">
    <a href="https://github.com/vlnn">Github</a> | <a href="https://vlnn.dev/projects.html">Projects</a>
  </div>
</div></div>
<div id="content">
<div class="post-date">08 Oct 2022</div><h1 class="post-title"><a href="https://vlnn.dev/2022-10-08-привіт,-чудовий-світе.html">Привіт, чудовий світе</a></h1>

<div id="outline-container-org3894f23" class="outline-2">
<h2 id="org3894f23">WHO:</h2>
<div class="outline-text-2" id="text-org3894f23">
<p>
My name is Volodymyr Anokhin and this is my blog. You may know me as VLNN (mostly at <a href="https://github.com/vlnn">vlnn@github.com)</a>. I&rsquo;m Ukrainian and that&rsquo;s why instead of &ldquo;Hello, wonderful world&rdquo; you may see some Cyrillics in the title of this record.
</p>
</div>
</div>

<div id="outline-container-orgaa2047e" class="outline-2">
<h2 id="orgaa2047e">WHAT:</h2>
<div class="outline-text-2" id="text-orgaa2047e">
<p>
This is another try to set up minimalistic mostly technical blog. I plan to write things about my current projects which are mostly software-related at the moment. I was working as a Radio Engineer, as an Engineering Manager, and now I am a software developer. Somehow I always have chosen less-popular programming languages, and so I was writing production code in J, FORTH and APL. Now I moved a bit to more conventional side of Clojure.
</p>
</div>
</div>

<div id="outline-container-org4973cb3" class="outline-2">
<h2 id="org4973cb3">WHY:</h2>
<div class="outline-text-2" id="text-org4973cb3">
<p>
It&rsquo;s not my first try to set up a place to share some technical or not-that-technical stuff across the internet. But somehow all the &ldquo;social&rdquo; platforms tend to become a social burden, and &ldquo;technical&rdquo; platforms tend to become more social with time. So I want to create a small piece of the network here, with smaller auditory but much bigger calmness. I&rsquo;m not even sure that I will enable comments here!
</p>
</div>
</div>

<div id="outline-container-org665ab7f" class="outline-2">
<h2 id="org665ab7f">WHEN:</h2>
<div class="outline-text-2" id="text-org665ab7f">
<p>
It&rsquo;s a wartime, joint forces of russia and belorussia are attacking and occupying parts of Ukraine right now. Perhaps not the best time to start a blog! But it&rsquo;s creation is not related to less chances of russia to kill or torture me. This is directly related to my plans to make everything I have to do during the war: support Ukrainian army, spend money for Ukrainian goods, and also represent Ukraine in every possible way. We are here. Some of us are still alive. We&rsquo;re kicking.
</p>

<p>
And we&rsquo;ll never forgive russians for what they did.
</p>
</div>
</div>
<div class="taglist"><a href="https://vlnn.dev/tags.html">Tags</a>: <a href="https://vlnn.dev/tag-admin.html">admin</a> <a href="https://vlnn.dev/tag-migration.html">migration</a> <a href="https://vlnn.dev/tag-war.html">war</a> </div>
<div id="comments"></div></div>
<div id="postamble" class="status"><div id="archive">
  <a href="https://vlnn.dev/archive.html">Other posts may be not available</a>
</div> </div>
</body>
</html>
